{"armorproficiencies":["Light armor"],
  "classlevel":[{"level1":["Bardic Inspiration - You can inspire others through stirring words or music. To do so, you use a bonus action on your turn to choose one creature other than yourself within 60 feet of you who can hear you. That creature gains one Bardic Inspiration die, a d6.Once within the next  10 minutes, the creature can roll the die and add the number rolled to one ability check, attack roll, or saving throw it makes. The creature can wait until after it rolls the d20 before deciding to use the Bardic Inspiration die, but must decide before the DM says whether the roll succeeds or fails. Once the Bardic Inspiration die is rolled, it is lost. A creature can have only one Bardic Inspiration die at a time. You can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain any expended uses when you finish a long rest."],
    "level10":["Bardic Inspiration - Your Bardic Inspiration die increases to a d10", "Expertise - You can choose another two skill proficiencies to gain this benefit.", "Magical Secrets - You have plundered magical knowledge from a wide spectrum of disciplines. Choose two spells from any class, including this one. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip. The chosen spells count as bard spells for you and are included in the number in the Spells Known column of the Bard table."],"level11":[],
    "level12":["Ability Score Improvement"],"level13":["Song of Rest - The extra hit points gained from Song of Rest increases to d10", "Proficiency Bonus - +5"],"level14":["Magical Secrets - You gain two additional spells from any list."],"level15":["Bardic Inspiration - Your Bardic Inspiration increases to d12."],"level16":["Ability Score Imporvement"],
    "level17":["Song of Rest - The extra hit points gained from Song of Rest increases to d12", "Proficiency Bonus - +6"],"level18":["Magical Secrets - You gain two additional spells from any list."],
    "level19":["Ability Score Improvement"],"level2":["Jack of All Trades - You can add half your proficiency bonus, rounded down, to any ability check you make that doesn’t already include your proficiency bonus.","Song of Rest - You can use soothing music or oration to help revitalize your wounded allies during a short rest. If you or any friendly creatures who can hear your performance regain hit points at the end of the short rest, each of those creatures regains an extra 1d6 hit points."],
    "level20":["Superior Inspiration - When you roll initiative and have no uses of Bardic Inspiration left, you regain one use."],"level3":["Choose a Bard College", "Expertise - Choose two of your skill proficiencies. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies."],"level4":["Ability Score Improvement"],"level5":["Font of Inspiration - You regain all of your expended uses of Bardic Inspiration when you finish a short or long rest.","Proficiency Bonus - +3"],
    "level6":["Countercharm - You gain the ability to use musical notes or words of power to disrupt mind-influencing effects. As an action, you can start a performance that lasts until the end of your next turn. During that time, you and any friendly creatures within 30 feet of you have advantage on saving throws against being frightened or charmed.A creature must be able to hear you to gain this benefit. The performance ends early if you are incapacitated or silenced or if you voluntarily end it (no action required)."],"level7":[],"level8":["Ability Score Improvement"],"level9":["Song of Rest - The extra hit points gained from Song of Rest increases to d8","Proficiency Bonus - +4"]}],
  "classskills":["Persuasion","Performance","Deception","Medicine","Insight","Religion","Investigation","History","Arcana","Stealth","Sleight of Hand","Acrobatics","Animal Handling","Athletics","Intimidation", "Nature","Perception","Survival"],"displayname":"bard","hitdie":"8","name":"bard","saveproficiences":["Dexterity","Charisma"],
  "skillcount":"3","spellcastingability":"Charisma","spellprogression":"Full","toolproficiences":["Three Musical instruments of your choice"],"weaponfroficiences":["Simple weapons","Hand crossbows", "Longswords", "Rapiers", "Shortswords"]}