{"baseclass":"cleric","displayname":"knowledge","level1":["Knowledge Domain Spells - See the book.", "Blessings of Knowledge - You learn two languages of your choice. You also become proficient in your choice of two of the following skills: Arcana, History, Nature, or Religion. Your proficiency bonus is doubled for any ability check you make that uses either of those skills."],"level10":[],
  "level11":[],"level12":[],
  "level13":[],"level14":[],
  "level15":[],"level16":[],"level17":["Visions of the Past - You can call up visions of the past that relate to an object you hold or your immediate surroundings. You spend at least  1  minute in meditation and prayer, then receive dreamlike, shadowy glimpses of recent events. You can meditate in this way for a number of minutes equal to your Wisdom score and must maintain concentration during that time, as if you were casting a spell.Once you use this feature, you can’t use it again until you finish a short or long rest. (See rules)."],
  "level18":[],
  "level19":[],"level2":["Channel Divinity - You can use your Channel Divinity to tap into a divine well of knowledge. As an action, you choose one skill or tool. For 10 minutes, you have proficiency with the chosen skill or tool."],
  "level20":[],"level3":[],
  "level4":[],"level5":[],"level6":["Channel Divinity - You can use your Channel Divinity to read a creature’s thoughts. You can then use your access to the creature’s mind to command it. As an action, choose one creature that you can see within 60 feet of you. That creature must make a W isdom  saving throw. If the creature succeeds on the saving throw, you can’t use this feature on it again until you finish a long rest. If the creature fails its save, you can read its surface thoughts (those foremost in its mind, reflecting its current emotions and what it is actively thinking about) when it is within 60 feet of you. This effect lasts for 1 minute. During that time, you can use your action to end this effect and cast the suggestion spell on the creature without expending a spell slot. The target automatically fails its saving throw against the spell."],
  "level7":[],
  "level8":["Potent Spellcasting - You add your Wisdom modifier to the damage you deal with any cleric cantrip."],"level9":[],"name":"knowledge"}