{"armorproficiencies":["Light armor", "Medium armor", "Shields", "(Druids will not wear armor or use shields made of metal.)"],
  "classlevel":[{"level1":["Druidic - You know Druidic, the secret language of druids. You can speak the language and use it to leave hidden messages. You and others who know this language automatically spot such a message. Others spot the message’s presence with a successful DC  15 Wisdom  (Perception) check but can’t decipher it without magic."],
    "level10":[],"level11":[],
    "level12":["Ability Score Improvement"],"level13":["Proficiency Bonus - +5"],"level14":[],"level15":[],"level16":["Ability Score Imporvement"],
    "level17":["Proficiency Bonus - +6"],"level18":["Timeless Body - The primal magic that you wield causes you to age more slowly. For every 10 years that pass, your body ages only 1 year.", "Beast Spells - you can cast many of your druid spells in any shape you assume using Wild Shape. You can perform the somatic and verbal components of a druid spell while in a beast shape, but you aren’t able to provide material components."],
    "level19":["Ability Score Improvement"],"level2":["Choose a Druid Circle", "Wild Shape - You can use your action to magically assume the shape of a beast that you have seen before. You can use this feature twice. You regain expended uses when you finish a short or long rest. (See rules)."],
    "level20":["Archdruid - You can use your Wild Shape an unlimited number of times."],"level3":[],"level4":["Ability Score Improvement", "Wild Shape Improvement - You can wild shape into creatures up to 1/2 CR and no flying speed."],"level5":["Proficiency Bonus - +3"],
    "level6":[],"level7":[],"level8":["Ability Score Improvement", "Wild Shape Improvement - You can wild shape into creatures up to 1 CR."],"level9":["Proficiency Bonus - +4"]}],
  "classskills":["Medicine","Insight","Religion","Arcana","Animal Handling", "Nature","Perception","Survival"],"displayname":"druid","hitdie":"8","name":"druid","saveproficiences":["Intelligence","Wisdom"],
  "skillcount":"2","spellcastingability":"Wisdom","spellprogression":"Full","toolproficiences":["Herbalism kit"],"weaponfroficiences":["Clubs", "Daggers", "Darts", "Javelins", "Maces", "Quarterstaffs", "Scimitars", "Sickles", "Slings", "Spears"]}