{"armorproficiencies":["None"],
  "classlevel":[{"level1":["Unarmored Defense - While you are wearing no armor and not wielding a shield, your AC equals  10 + your Dexterity modifier + your Wisdom modifier.", "Martial Arts - Your practice of martial arts gives you mastery of combat styles that use unarmed strikes and monk weapons, which are shortswords and any simple melee weapons that don’t have the two-handed or heavy property. (See rules)."],
    "level10":["Purity of Body - Your mastery of the ki flowing through you makes you immune to disease and poison."],"level11":[],
    "level12":["Ability Score Improvement"],"level13":["Tongue of the Sun and Moon - You learn to touch the ki of other minds so that you understand all spoken languages. Moreover, any creature that can understand a language can understand what you say.","Proficiency Bonus - +5"],"level14":["Diamond Soul - Your mastery of ki grants you proficiency in all saving throws.Additionally, whenever you make a saving throw and fail, you can spend 1  ki point to reroll it and take the second result."],
    "level15":["Timeless Body - Your ki sustains you so that you suffer none of the frailty of old age, and you can't be aged magically. You can still die of old age, however. In addition, you no longer need food or water."],"level16":["Ability Score Imporvement"],
    "level17":["Proficiency Bonus - +6"],"level18":["Empty Body - You can use your action to spend 4 ki points to become invisible for 1 minute. During that time, you also have resistance to all damage but force damage.Additionally, you can spend 8 ki points to cast the astral projection spell, without needing material components. When you do so, you can’t take any other creatures with you."],
    "level19":["Ability Score Improvement"],"level2":["Unarmored Movement - Your speed increases by 10 feet while you are not wearing armor or wielding a shield. This bonus increases when you reach certain monk levels, as shown in the Monk table."],
    "level20":["Perfect Soul - When you roll for initiative and have no ki points remaining, you regain 4 ki points."],"level3":["Choose a Monastic Tradition", "Deflect Missiles - You can use your reaction to deflect or catch the missile when you are hit by a ranged weapon attack. When you do so, the damage you take from the attack is reduced by 1d10 + your Dexterity modifier + your monk level. If you reduce the damage to 0, you can catch the missile if it is small enough for you to hold in one hand and you have at least one hand free. If you catch a missile in this way, you can spend 1 ki point to make a ranged attack with the weapon or piece of ammunition you just caught, as part of the same reaction. You make this attack with proficiency, regardless of your weapon proficiencies, and the missile counts as a monk weapon for the attack."],
    "level4":["Ability Score Improvement", "Slow Fall - You can use your reaction when you fall to reduce any falling damage you take by an amount equal to five times your monk level."],"level5":["Extra Attack - You can attack twice, whenever you take the Attack action on your turn.","Stunning Strike - You can interfere with the flow of ki in an opponent’s body. When you hit another creature with a melee weapon attack, you can spend 1 ki point to attempt a stunning strike. The target must succeed on a Constitution saving throw or be stunned until the end of your next turn.","Proficiency Bonus - +3"],
    "level6":["Ki-Empowered Strikes - Your unarmed strikes count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage."],"level7":["Evasion - Your instinctive agility lets you dodge out of the way of certain area effects, such as a blue dragon’s lightning breath or a fireball spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail.", "Stillness of Mind - You can use your action to end one effect on yourself that is causing you to be charmed or frightened."],
    "level8":["Ability Score Improvement"],"level9":["Proficiency Bonus - +4", "Unarmored Movement Improvement - You gain the ability to move along vertical surfaces and across liquids on your turn without falling during the move."]}],
  "classskills":["Acrobatics","Athletics","Insight","Religion","History","Stealth"],"displayname":"monk","hitdie":"8","name":"monk","saveproficiences":["Strength","Dexterity"],
  "skillcount":"2","spellcastingability":"None","spellprogression":"None","toolproficiences":["Choose one type of artisan's tools or one musical instrument."],"weaponfroficiences":["Simple weapons", "Shortsword"]}