{"armorproficiencies":["Light armor", "Medium armor", "Shields"],
  "classlevel":[{"level1":["Favored Enemy - You have significant experience studying, tracking, hunting, and even talking to a certain type of enemy.Choose a type of favored enemy: aberrations, beasts, celestials, constructs, dragons, elementals, fey, fiends, giants, monstrosities, oozes, plants, or undead. Alternatively, you can select two races of humanoid (such as gnolls and orcs) as favored enemies.You have advantage on Wisdom (Survival) checks to track your favored enemies, as well as on Intelligence checks to recall information about them. When you gain this feature, you also learn one language of your choice that is spoken by your favored enemies, if they speak one at all.", "Natural Explorer - You are particularly familiar with one type of natural environment and are adept at traveling and surviving in such regions. Choose one type of favored terrain: arctic, coast, desert, forest, grassland, mountain, swamp, or the Underdark. When you make an Intelligence or Wisdom  check related to your favored terrain, your proficiency bonus is doubled if you are using a skill that you’re proficient in."],
    "level10":["Hide in Plain Sight - You can spend 1  minute creating camouflage for yourself. You must have access to fresh mud, dirt, plants, soot, and other naturally occurring materials with which to create your camouflage.Once you are camouflaged in this way, you can try to hide by pressing yourself up against a solid surface, such as a tree or wall, that is at least as tall and wide as you are. You gain a +10 bonus to Dexterity (Stealth) checks as long as you remain there without moving or taking actions. Once you move or take an action or a reaction, you must camouflage yourself again to gain this benefit." , "Natural Explorer Improvement - You gain an additional favored terrain."],
    "level11":[],
    "level12":["Ability Score Improvement"],"level13":["Proficiency Bonus - +5"],"level14":["Vanish - You can use the Hide action as a bonus action on your turn. Also, you can’t be tracked by nonmagical means, unless you choose to leave a trail.", "Favored Enemy Improvement - You gain one additional favored enemy as well as an associated language."],
    "level15":[],"level16":["Ability Score Imporvement"],
    "level17":["Proficiency Bonus - +6"],"level18":["Feral Senses - You gain preternatural senses that help you fight creatures you can’t see. When you attack a creature you can’t see, your inability to see it doesn’t impose disadvantage on your attack rolls against it. You are also aware of the location of any invisible creature within 30 feet of you, provided that the creature isn’t hidden from you and you aren’t blinded or deafened."],
    "level19":["Ability Score Improvement"],"level2":["Choose a fighting style - Archery, Defence, Dueling, Great Weapon Fighting, Protection, Two-Weapon Fighting"],
    "level20":["For Slayer - You become an unparalleled hunter of your enemies. Once on each of your turns, you can add your Wisdom  modifier to the attack roll or the damage roll of an attack you make against one of your favored enemies. You can choose to use this feature before or after the roll, but before any effects of the roll are applied."],"level3":["Choose a Ranger Archetype", "Primeval Awareness - You can use your action and expend one ranger spell slot to focus your awareness on the region around you. For 1  minute per level of the spell slot you expend, you can sense whether the following types of creatures are present within  1  mile of you (or within up to 6 miles if you are in your favored terrain): aberrations, celestials, dragons, elementals, fey, fiends, and undead. This feature doesn’t reveal the creatures’ location or number."],
    "level4":["Ability Score Improvement"],"level5":["Extra Attack - You can attack twice, whenever you take the Attack action on your turn.", "Proficiency Bonus - +3"],
    "level6":["Favored Enemy Improvement - You gain one additional favored enemy as well as an associated language.", "Natural Explorer Improvement - You gain an additional favored terrain."],"level7":[],
    "level8":["Ability Score Improvement", "Land's Stride - Moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard. In addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such those created by the entangle spell."],"level9":["Proficiency Bonus - +4"]}],
  "classskills":["Animal Handling","Athletics","Insight","Investigation","Nature","Perception", "Stealth", "Survival"],"displayname":"ranger","hitdie":"10","name":"ranger","saveproficiences":["Strength","Dexterity"],
  "skillcount":"3","spellcastingability":"Wisdom","spellprogression":"Half","toolproficiences":["None"],"weaponfroficiences":["Simple weapons", "Martial weapons"]}