{"archetypes":{"baseclass":"Fighter","displayname":"Champion","level1":[],"level10":["Additional Fighting Style - Choose a second option from the Fighting Style class feature."],"level11":[],"level12":[],"level13":[],"level14":[],"level15":["Superior Critical - Your weapon attacks score a critical hit on a roll of 18-20."],"level16":[],"level17":[],"level18":["Survivor - You attain the pinnacle of resilience in battle. At the start of each of your turns, you regain hit points equal to 5 + your Constitution modifier if you have no more than half of your hit points left. you don\u0027t gain this benefit if you have O hit points."],"level19":[],"level2":[],"level20":[],"level3":["Improved Critical - Your weapon attacks score a critical hit on a roll of 19 or 20."],"level4":[],"level5":[],"level6":[],"level7":["Remarkable Athlete - You can add half of your proficiency bonus (round up) to any Strength, Dexterity, or Constitution check you make that doesn\u0027t already use your proficiency bonus. In addition, when you make a running long jump, the distance you can cover increases by a number of feet equal to your Strength modifier."],"level8":[],"level9":[],"name":"Champion"},"backgrounds":{"backgroundfeature":"You have a military rank from your career as a soldier. Soldiers loyal to your former military organization still recognize your authority and influence, and they defer to you if they are of a lower rank. You can invoke your rank to exert influence over other soldiers and requisition simple equipment or horses for temporary use. You can aIso usually gain access to friendly military encampments and fortresses where your rank is recognized.","backgroundname":"Soldier","equipment":"An insignia of rank, a trophy taken from a fallen enemy (a dagger, broken blade, or piece of a banner), a set of bone dice or deck of cards, a set of common clothes, and a beIt pouch containing 10 gp","languages":[],"setskillproficiency":[{"Athletics":"true","Intimidation":"true"}],"toolproficiences":["One type of gaming set.","Vehicles (land)."]},"charisma":12,"classes":{"armorproficiencies":["All armor","shields"],"classlevel":[{"level1":["Choose a fighting style: Archery, Defence, Dueling, Great Weapon Fighting, Protection, Two-Weapon Fighting"],"level10":[],"level11":["Extra Attack - You can attack three times when you take the attack action."],"level12":["Ability Score Improvement"],"level13":["Indomitable - You can use this feature twice between long rests."],"level14":["Ability Score Improvement"],"level15":[],"level16":["Ability Score Imporvement"],"level17":["Indomitable - You can use this feature three times between long rests."],"level18":[],"level19":["Ability Score Improvement"],"level2":["Second Wind -  On your turn, you can use a bonus action to regain hit points equal to ld10 +your fighter leveI. Once you use this feature, you must finish a short or long rest before you can use it again.","Action Surge -  On your turn, you can take one additional action on top of your regular action and a possible bonus action."],"level20":["Extra Attack - You can attack four times when you take the attack action."],"level3":["Choose a Martial Archetype"],"level4":["Ability Score Improvement"],"level5":["Extra Attack - You can attack twice, instead of once, whenever you take the Attack action on your turn.","Proficiency Bonus - +3"],"level6":["Ability Score Improvement"],"level7":[],"level8":["Ability Score Improvement"],"level9":["Indomitable - You can reroll a saving throw that you fail. If you do so, you must use the new roll, and you can\u0027t use this feature again until you finish a long rest. "]}],"classskills":["Acrobatics","Animal Handling","Athletics","History","Insight","Intimidation","Perception","Survival"],"displayname":"Fighter","hitdie":"10","name":"Fighter","saveproficiences":["Strength","Constitution"],"skillcount":"2","spellcastingability":"None","spellprogression":"None","toolproficiences":["None"],"weaponfroficiences":["Simple weapons","Martial weapons"]},"constitution":16,"dexterity":14,"hp":12,"intelligence":12,"inventory":["Longsword"],"level":"1","name":"Mitchell","races":[{"abilityscorebonuses":[{"Charisma":"1","Constitution":"1","Dexterity":"1","Intelligence":"1","Strength":"1","Wisdom":"1"}],"displayname":"Human","features":[{"featuretextwithbullet":["Feature #1","Feature #2"],"setskillproficiency":[{"Deception":"true","Insight":"true"}]}],"languages":["Common","One Extra Language"],"name":"Human","speed":"30"}],"strength":18,"wisdom":10}